Revit 2027 API
TransactionGroup.IsFailureHandlingForcedModal Property
 Forces all transactions finished inside this group to use modal failure handling regardless of what failure handling options are set for those transactions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFailureHandlingForcedModal { get; set; }
Public Property IsFailureHandlingForcedModal As Boolean
	Get
	Set
public:
property bool IsFailureHandlingForcedModal {
	bool get ();
	void set (bool value);
}
member IsFailureHandlingForcedModal : bool with get, set
Property Value
Boolean
Remarks
 This property is ignored during events, when failure handling is always modal.
See Also
Reference
TransactionGroup Class
Autodesk.Revit.DB Namespace